print("Шляпка гриба, покрытая кожиц(1)й, держится на ножк(2) . Снизу шляпка затянута плёнкой. Когда её уб(3)рёшь, откроется нижн(4)я сторона шляпк(5) .")

a = input("введите пропуск(1): ")
h = input("введите пропуск(2): ")
c = input("введите пропуск(3): ")
d = input("введите пропуск(4): ")
e = input("введите пропуск(5): ")

print(f"Шляпка гриба, покрытая кожиц{a}й, держится на ножк{h} . Снизу шляпка затянута плёнкой. Когда её уб{c}рёшь, откроется нижн{d}я  сторона шляпк{e} .")

if a =='е' and h == 'е' and c == 'е' and d == 'я' and e == 'а'  :
  print('Молодца!')
else:
  print(' неправильно, сделай еще раз :( ')
  




